## Plan Result (sds_ptl - TerraformPlanApply)




<pre><code>Plan: 9 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-DEMO&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-DEV&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-ITHC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-SBOX&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-STG&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-TEST&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICESPTL&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;]
* Update
  * azurerm_user_assigned_identity.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-DEMO"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a26d6f55-771b-4eed-b84a-6976ec884c12"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-DEV"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ac456836-3083-4e87-9107-35bec95926d5"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-ITHC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "23101045-7ca9-444d-9b67-8d408465126a"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0ad7e647-a69f-4602-801e-c376779334c2"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6e3f5588-8805-4fcd-98d7-dc5a2d6e7011"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-STG"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9811e238-e068-4802-a13c-f67a5945f03f"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-TEST"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "250331e9-0752-4df7-92a9-fa467da91afa"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICESPTL"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cad3dcf5-9ca4-4f45-a219-13a8d8003d9f"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICESPTL-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "88056f13-ab02-414f-9f35-7cfe13a4c19c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.this will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "this" {
        id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sds-alerts-slack-ptl"
        name                = "sds-alerts-slack-ptl"
      ~ tags                = {
          - "application"  = "core" -> null
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (5 unchanged attributes hidden)
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":31,"Program":"tfcmt","SHA1":"","Target":"sds_ptl - TerraformPlanApply","Vars":{}} -->